Revit 2022 API
AnalyticalModelSketchComponent.IsValidAnalyticalAlignmentMethod Method
 Indicates whether Analytical Alignment Method is valid for Sketch Component.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2011
Syntax
C#
public bool IsValidAnalyticalAlignmentMethod(
	AnalyticalAlignmentMethod alignmentMethod
)
Visual Basic
Public Function IsValidAnalyticalAlignmentMethod ( _
	alignmentMethod As AnalyticalAlignmentMethod _
) As Boolean
Visual C++
public:
bool IsValidAnalyticalAlignmentMethod(
	AnalyticalAlignmentMethod alignmentMethod
)
Parameters
alignmentMethod
Type: Autodesk.Revit.DB.Structure.AnalyticalAlignmentMethod
 Analytical Alignment Method preset to test for validity.
Return Value
 True means alignment method is valid, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalModelSketchComponent Class
Autodesk.Revit.DB.Structure Namespace